In [5]:
import pandas as pd

In [6]:
data = {
    'Roll Number': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Isaac', 'Jack'],
    'Gender': ['F', 'M', 'M', 'M', 'F', 'M', 'F', 'F', 'M', 'M'],
    'Marks1': [35, 78, 92, 67, 89, 55, 91, 88, 40, 52],
    'Marks2': [90, 85, 58, 62, 78, 83, 95, 37, 68, 40],
    'Marks3': [79, 92, 84, 70, 38, 66, 90, 45, 53, 81]
}

df = pd.DataFrame(data)

df

   Roll Number     Name Gender  Marks1  Marks2  Marks3
0          101    Alice      F      35      90      79
1          102      Bob      M      78      85      92
2          103  Charlie      M      92      58      84
3          104    David      M      67      62      70
4          105      Eve      F      89      78      38
5          106    Frank      M      55      83      66
6          107    Grace      F      91      95      90
7          108   Hannah      F      88      37      45
8          109    Isaac      M      40      68      53
9          110     Jack      M      52      40      81

In [22]:
df["Total_Marks"] = df.iloc[:,df.columns.get_loc("Marks1"):(df.columns.get_loc("Marks3"))+1].sum(axis=1)

print(df)

   Roll Number     Name Gender  Marks1  Marks2  Marks3  Total_Marks
0          101    Alice      F      35      90      79          204
1          102      Bob      M      78      85      92          255
2          103  Charlie      M      92      58      84          234
3          104    David      M      67      62      70          199
4          105      Eve      F      89      78      38          205
5          106    Frank      M      55      83      66          204
6          107    Grace      F      91      95      90          276
7          108   Hannah      F      88      37      45          170
8          109    Isaac      M      40      68      53          161
9          110     Jack      M      52      40      81          173

In [24]:
low_mk1 = df["Marks1"].min()
low_mk1

35

In [27]:
high_mk2 = df["Marks2"].max()
high_mk2

95

In [19]:
avg_mk3 = df["Marks3"].mean()
avg_mk3

69.8

In [23]:
df["Avg_Marks"] = df.iloc[:,df.columns.get_loc("Marks1"):(df.columns.get_loc("Marks3"))+1].mean(axis=1)

print(df)

   Roll Number     Name Gender  Marks1  Marks2  Marks3  Total_Marks  Avg_Marks
0          101    Alice      F      35      90      79          204  68.000000
1          102      Bob      M      78      85      92          255  85.000000
2          103  Charlie      M      92      58      84          234  78.000000
3          104    David      M      67      62      70          199  66.333333
4          105      Eve      F      89      78      38          205  68.333333
5          106    Frank      M      55      83      66          204  68.000000
6          107    Grace      F      91      95      90          276  92.000000
7          108   Hannah      F      88      37      45          170  56.666667
8          109    Isaac      M      40      68      53          161  53.666667
9          110     Jack      M      52      40      81          173  57.666667

In [31]:
df.iloc[df['Avg_Marks'].idxmax(),df.columns.get_loc("Name")]

'Grace'

In [35]:
df[df['Marks2'] < 40].shape[0]

1

In [36]:
summary = df.describe(percentiles=[0.25, 0.5, 0.75])
summary

       Roll Number     Marks1     Marks2     Marks3  Total_Marks  Avg_Marks
count     10.00000  10.000000  10.000000  10.000000    10.000000  10.000000
mean     105.50000  68.700000  69.600000  69.800000   208.100000  69.366667
std        3.02765  21.959812  20.227594  18.960778    37.281065  12.427022
min      101.00000  35.000000  37.000000  38.000000   161.000000  53.666667
25%      103.25000  52.750000  59.000000  56.250000   179.500000  59.833333
50%      105.50000  72.500000  73.000000  74.500000   204.000000  68.000000
75%      107.75000  88.750000  84.500000  83.250000   226.750000  75.583333
max      110.00000  92.000000  95.000000  92.000000   276.000000  92.000000